src/Catalogs/ar_ДополнительныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_ДополнительныеНастройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ЗначениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ar_Значения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_ЗначениеСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Включено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ar_ДополнительныеНастройки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Форма элемента справочника ar_ДополнительныеНастройки (PAY-01).
//
// Реквизиты ar_Значение (составной: Булево/Число/Дата) и ar_ЗначениеСтрока
// (строка неограниченной длины) объекта показываются оператору как ОДНО поле
// "ЗначениеОтображение" - деталь хранения (два физических реквизита) от
// оператора скрыта. Реквизит формы ТипЗначения ("Строка"/"Число"/"Дата"/
// "Булево") определяет, в какое из двух полей объекта уходит значение при
// записи.
//
// Реквизит формы ВидНастройки ("Скаляр"/"Список") управляет видимостью группы
// одиночного значения vs таблицы ar_Значения - определяется при открытии по
// факту заполненности данных (см. .docs/specs/PAY-01.md, §UI справочника
// настроек).
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОпределитьТипЗначенияПоОбъекту();
	ОпределитьВидНастройкиПоОбъекту();
	ЗаполнитьЗначениеОтображениеИзОбъекта();
	ОбновитьВидимостьПоВидуНастройки(ЭтаФорма);

КонецПроцедуры

// Перед записью переносит ЗначениеОтображение (единое поле формы) обратно в
// физические реквизиты объекта: Объект.ar_ЗначениеСтрока для типа "Строка",
// Объект.ar_Значение - для прочих (Булево/Число/Дата). При виде настройки
// "Список" скалярные поля объекта очищаются - значение хранится только в ТЧ
// ar_Значения (взаимоисключимость Скаляр/Список).
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ПараметрыЗаписи)

	Если ВидНастройки = "Список" Тогда
		Объект.ar_Значение = Ложь;
		Объект.ar_ЗначениеСтрока = "";
		Возврат;
	КонецЕсли;

	Если ТипЗначения = "Строка" Тогда
		Объект.ar_ЗначениеСтрока = СокрЛП(Строка(ЗначениеОтображение));
		Объект.ar_Значение = Ложь;
	ИначеЕсли ТипЗначения = "Булево" Тогда
		Объект.ar_Значение = (ЗначениеОтображение = Истина);
		Объект.ar_ЗначениеСтрока = "";
	ИначеЕсли ТипЗначения = "Число" Тогда
		Если ТипЗнч(ЗначениеОтображение) = Тип("Число") Тогда
			Объект.ar_Значение = ЗначениеОтображение;
		Иначе
			Объект.ar_Значение = 0;
		КонецЕсли;
		Объект.ar_ЗначениеСтрока = "";
	ИначеЕсли ТипЗначения = "Дата" Тогда
		Если ТипЗнч(ЗначениеОтображение) = Тип("Дата") Тогда
			Объект.ar_Значение = ЗначениеОтображение;
		Иначе
			Объект.ar_Значение = '00010101';
		КонецЕсли;
		Объект.ar_ЗначениеСтрока = "";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// Переключение Скаляр/Список - управляет видимостью группы одиночного
// значения и таблицы списка (см. докстринг модуля).
&НаКлиенте
Процедура ВидНастройкиПриИзменении(Элемент)

	ОбновитьВидимостьПоВидуНастройки(ЭтаФорма);

КонецПроцедуры

// Смена типа значения - переформатирует ЗначениеОтображение под новый тип
// (без потери уже введённых данных там, где конвертация возможна).
&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)

	ПривестиЗначениеОтображениеКТипу();

КонецПроцедуры

// Ввод значения в единое поле - серверная часть не требуется: при записи
// формы ЗначениеОтображение переносится в Объект.ar_Значение/ar_ЗначениеСтрока
// (см. ПередЗаписьюНаСервере).
&НаКлиенте
Процедура ЗначениеОтображениеПриИзменении(Элемент)

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет ТипЗначения реквизита формы по факту заполненности объекта.
// Непустая ar_ЗначениеСтрока -> "Строка". Иначе - по типу ar_Значение "как
// есть" (Булево=Ложь/Число=0/пустая Дата - ЗАКОННЫЕ значения, см. докстринг
// ar_Настройки.ЗначениеНастройки - тот же принцип: различить "не заполнено"
// от "явно 0/Ложь" без отдельного флага нельзя, поэтому берём тип фактически
// хранимого значения). Для действительно нового элемента (оба поля пусты,
// ar_Значение = Ложь по умолчанию платформы) - безопасный дефолт "Строка".
&НаСервере
Процедура ОпределитьТипЗначенияПоОбъекту()

	Если Не ПустаяСтрока(Объект.ar_ЗначениеСтрока) Тогда
		ТипЗначения = "Строка";
	ИначеЕсли ТипЗнч(Объект.ar_Значение) = Тип("Число") Тогда
		ТипЗначения = "Число";
	ИначеЕсли ТипЗнч(Объект.ar_Значение) = Тип("Дата") Тогда
		ТипЗначения = "Дата";
	Иначе
		// Булево=Ложь неотличимо от "не заполнено" - для нового элемента
		// (создан только что, значение не вводили) дефолт "Строка" удобнее
		// оператору, чем скрытое Булево=Ложь.
		ТипЗначения = "Строка";
	КонецЕсли;

КонецПроцедуры

// Определяет ВидНастройки ("Скаляр"/"Список") по факту заполненности:
// непустая ТЧ ar_Значения -> "Список"; иначе -> "Скаляр" (в т.ч. для нового
// элемента - безопасный дефолт).
&НаСервере
Процедура ОпределитьВидНастройкиПоОбъекту()

	Если Объект.ar_Значения.Количество() > 0 Тогда
		ВидНастройки = "Список";
	Иначе
		ВидНастройки = "Скаляр";
	КонецЕсли;

КонецПроцедуры

// Переносит текущее значение объекта (ar_Значение/ar_ЗначениеСтрока) в единое
// поле формы ЗначениеОтображение согласно уже определённому ТипЗначения.
&НаСервере
Процедура ЗаполнитьЗначениеОтображениеИзОбъекта()

	Если ТипЗначения = "Строка" Тогда
		ЗначениеОтображение = Объект.ar_ЗначениеСтрока;
	ИначеЕсли ТипЗначения = "Булево" Тогда
		ЗначениеОтображение = (ТипЗнч(Объект.ar_Значение) = Тип("Булево")) И Объект.ar_Значение;
	ИначеЕсли ТипЗначения = "Число" Тогда
		Если ТипЗнч(Объект.ar_Значение) = Тип("Число") Тогда
			ЗначениеОтображение = Объект.ar_Значение;
		Иначе
			ЗначениеОтображение = 0;
		КонецЕсли;
	ИначеЕсли ТипЗначения = "Дата" Тогда
		Если ТипЗнч(Объект.ar_Значение) = Тип("Дата") Тогда
			ЗначениеОтображение = Объект.ar_Значение;
		Иначе
			ЗначениеОтображение = '00010101';
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Показывает группу одиночного значения либо таблицу списка - взаимоисключимо,
// оператор не должен заполнять оба места одновременно.
//
// Вызывается И с сервера (ПриСозданииНаСервере), И с клиента
// (ВидНастройкиПриИзменении), поэтому директива - &НаКлиентеНаСервереБезКонтекста
// (порядок частей именно такой: Клиент->Сервер, обратный = Unknown annotation).
// Форма передаётся параметром: без контекста прямого доступа к Элементы нет.
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьПоВидуНастройки(Форма)

	ЭтоСкаляр = (Форма.ВидНастройки = "Скаляр");
	Форма.Элементы.ГруппаСкаляр.Видимость = ЭтоСкаляр;
	Форма.Элементы.ar_Значения.Видимость = Не ЭтоСкаляр;

КонецПроцедуры

// Приводит текущее ЗначениеОтображение к вновь выбранному ТипЗначения -
// избегает Type mismatch при записи, если оператор сменил тип уже после
// ввода значения другого типа.
&НаКлиенте
Процедура ПривестиЗначениеОтображениеКТипу()

	Если ТипЗначения = "Строка" Тогда
		ЗначениеОтображение = СокрЛП(Строка(ЗначениеОтображение));
	ИначеЕсли ТипЗначения = "Булево" Тогда
		ЗначениеОтображение = (ЗначениеОтображение = Истина);
	ИначеЕсли ТипЗначения = "Число" Тогда
		// Если уже число - оставляем как есть, иначе сбрасываем в 0.
		Если ТипЗнч(ЗначениеОтображение) <> Тип("Число") Тогда
			ЗначениеОтображение = 0;
		КонецЕсли;
	ИначеЕсли ТипЗначения = "Дата" Тогда
		// Если уже дата - оставляем как есть, иначе сбрасываем в пустую дату.
		Если ТипЗнч(ЗначениеОтображение) <> Тип("Дата") Тогда
			ЗначениеОтображение = '00010101';
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
